qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/Source/ble/ble_db_discovery.c
        // Loop through all the descriptors to find the CCCD.
        for (i = 0; i < p_desc_disc_rsp_evt->count; i++)
        {
            if (
                p_desc_disc_rsp_evt->descs[i].uuid.uuid ==
                BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG
               )
            {
                p_char_being_discovered->cccd_handle = p_desc_disc_rsp_evt->descs[i].handle;

                break;
            }
        }
    }

    bool raise_discov_complete = false;

    if ((p_db_discovery->curr_char_ind + 1) == p_srv_being_discovered->char_count)
    {
        // No more characteristics and descriptors need to be discovered. Discovery is complete.
        // Send a discovery complete event to the user application.

        raise_discov_complete = true;
    }
    else
    {
        // Begin discovery of descriptors for the next characteristic.
        uint32_t err_code;

        p_db_discovery->curr_char_ind++;

        err_code = descriptors_discover(p_db_discovery, &raise_discov_complete);

        if (err_code != NRF_SUCCESS)
        {
            p_db_discovery->discovery_in_progress = false;

            // Error with discovering the service.
            // Indicate the error to the registered user application.
            discovery_error_evt_trigger(p_db_discovery, err_code);

            return;
        }
    }

    if (raise_discov_complete)
    {
        discovery_complete_evt_trigger(p_db_discovery, true);

        on_srv_disc_completion(p_db_discovery);
    }
}

static void db_discovery_continue_handler(void * p_context)
{
    ble_db_discovery_t *p_db = (ble_db_discovery_t *)p_context;
    ble_db_discovery_srv_t * p_srv_being_discovered;
    uint32_t err_code;

    if (p_db == NULL) {
        return;
    }
    if (p_db->discovery_in_progress == true) {
        APP_ERROR_CHECK(app_timer_start(m_db_discovery_timer, DB_DISCOVERY_INTERVAL, p_context));
        return;
    }

    if (m_num_of_discoveries_made < m_num_of_handlers_reg) {
        p_db->discovery_in_progress = true;
        p_db->curr_char_ind = 0;
        p_db->curr_srv_ind++;

        p_srv_being_discovered = &(p_db->services[p_db->curr_srv_ind]);
        p_srv_being_discovered->srv_uuid =
            m_registered_handlers[p_db->curr_srv_ind].srv_uuid;

        p_srv_being_discovered->char_count = 0;

        err_code = sd_ble_gattc_primary_services_discover(
                   p_db->conn_handle,
                   SRV_DISC_START_HANDLE,
                   &(p_srv_being_discovered->srv_uuid));
        if (err_code != NRF_SUCCESS) {
            p_db->discovery_in_progress = false;
            p_db->curr_srv_ind--;
            APP_ERROR_CHECK(app_timer_start(m_db_discovery_timer, DB_DISCOVERY_INTERVAL, p_context));
            return;
        }
    }
}

uint32_t ble_db_discovery_init(void)
{
    m_num_of_handlers_reg      = 0;
    m_initialized              = true;
    m_num_of_discoveries_made  = 0;
    m_pending_usr_evt_index    = 0;

    APP_ERROR_CHECK(app_timer_create(&m_db_discovery_timer, APP_TIMER_MODE_SINGLE_SHOT, db_discovery_continue_handler));

    return NRF_SUCCESS;
}

uint32_t ble_db_discovery_evt_register(const ble_uuid_t * const             p_uuid,
                                       const ble_db_discovery_evt_handler_t evt_handler)
{
    if ((p_uuid == NULL) || (evt_handler == NULL))
    {
        return NRF_ERROR_NULL;
    }

    if (!m_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (m_num_of_handlers_reg == DB_DISCOVERY_MAX_USERS)
    {
        // The limit on the maximum number of supported users has been reached. Return error.
        return NRF_ERROR_NOT_SUPPORTED;
    }

    return registered_handler_set(p_uuid, evt_handler);
}


uint32_t ble_db_discovery_start(ble_db_discovery_t * const p_db_discovery,
                                uint16_t                   conn_handle)
{
    if (p_db_discovery == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if (!m_initialized)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (m_num_of_handlers_reg == 0)
    {
        // No user modules were registered. There are no services to discover.
        return NRF_ERROR_INVALID_STATE;
    }

    if (p_db_discovery->discovery_in_progress)
    {
        return NRF_ERROR_BUSY;
    }

    ble_db_discovery_srv_t * p_srv_being_discovered;

    m_num_of_discoveries_made = 0;
    m_pending_usr_evt_index   = 0;

    p_db_discovery->curr_srv_ind = 0;
    p_db_discovery->conn_handle  = conn_handle;

    p_srv_being_discovered = &(p_db_discovery->services[p_db_discovery->curr_srv_ind]);

    p_srv_being_discovered->srv_uuid = m_registered_handlers[p_db_discovery->curr_srv_ind].srv_uuid;
    
    uint32_t err_code;

    err_code = sd_ble_gattc_primary_services_discover(p_db_discovery->conn_handle,
                                                      SRV_DISC_START_HANDLE,
                                                      NULL);
                                                      //&(p_srv_being_discovered->srv_uuid));
    if (err_code != NRF_SUCCESS)
    {
    	debug_cnt[0]++;
        return err_code;
    }
    debug_cnt[1]++;
    p_db_discovery->discovery_in_progress = true;

    return NRF_SUCCESS;
}

uint8_t debug_timeout;

void ble_db_discovery_on_ble_evt(ble_db_discovery_t * const p_db_discovery,
                                 const ble_evt_t * const    p_ble_evt)
{
    if ((p_db_discovery == NULL) || (p_ble_evt == NULL))
    {
        // Null pointer provided. Return.
        return;
    }

    if (!m_initialized)
    {
        return;
    }

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            if (p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_CENTRAL) {
                p_db_discovery->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                APP_ERROR_CHECK(ble_db_discovery_start(p_db_discovery, p_ble_evt->evt.gap_evt.conn_handle));
            }
            break;
        
        case BLE_GAP_EVT_DISCONNECTED:
            if (!is_central(p_ble_evt->evt.gap_evt.conn_handle)) {
                memset(p_db_discovery, 0, sizeof(ble_db_discovery_t));
                p_db_discovery->conn_handle = BLE_CONN_HANDLE_INVALID;
            }
            break;

        case BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP:
            on_primary_srv_discovery_rsp(p_db_discovery, &(p_ble_evt->evt.gattc_evt));
            break;

        case BLE_GATTC_EVT_CHAR_DISC_RSP:
            on_characteristic_discovery_rsp(p_db_discovery, &(p_ble_evt->evt.gattc_evt));
            break;

        case BLE_GATTC_EVT_DESC_DISC_RSP:
            on_descriptor_discovery_rsp(p_db_discovery, &(p_ble_evt->evt.gattc_evt));
            break;

        case BLE_GATTC_EVT_TIMEOUT:
        	if (p_db_discovery->discovery_in_progress == true) {
    			debug_timeout = p_ble_evt->evt.gattc_evt.params.timeout.src;
    			APP_ERROR_CHECK(app_timer_start(m_db_discovery_timer, DB_DISCOVERY_INTERVAL, (void *)p_db_discovery));
        	}
        	break;

        default:
            break;
    }
}

